In [1]:
import pandas as pd
import numpy as np

In [2]:
table1 ={'Name':['Pikacu','Arikl','Dupta','Rasty','Dhrupb','Sikll','Tifu'], 'Marks':[15,58,77,92,33,55,87],'Age':[15,44,13,15,14,15,14],'Gender':['Male','Female','Male','Male','Female','Male','Female']
        }
x = ['a','b','c','d','e','f','g']
tab1=pd.DataFrame(table1 , index=x )
tab1

     Name  Marks  Age  Gender
a  Pikacu     15   15    Male
b   Arikl     58   44  Female
c   Dupta     77   13    Male
d   Rasty     92   15    Male
e  Dhrupb     33   14  Female
f   Sikll     55   15    Male
g    Tifu     87   14  Female

In [3]:
#Display Top 3 rows of the dataset
tab1.head(2)

     Name  Marks  Age  Gender
a  Pikacu     15   15    Male
b   Arikl     58   44  Female

In [4]:
#Display least 3 rows form dataset
tab1.tail(3)

     Name  Marks  Age  Gender
e  Dhrupb     33   14  Female
f   Sikll     55   15    Male
g    Tifu     87   14  Female

In [5]:
#find number of Rows and colum
tab1.shape

print(tab1.shape[0],'Rows')
print(tab1.shape[1],'Colum')

7 Rows
4 Colum

In [6]:
table2 ={'Name': ['Moho', 'Maya','Mona']}
tab2=pd.DataFrame(table2)
tab2

   Name
0  Moho
1  Maya
2  Mona

In [7]:
table3 = {'Name': ['Xyz','abc', 'drf','xdr'] , 'ID': [193002154,159785412,123665897,145895157]}
tab3=pd.DataFrame(table3)
tab3

  Name         ID
0  Xyz  193002154
1  abc  159785412
2  drf  123665897
3  xdr  145895157

In [8]:
table4 = {'FName': ['Mahfujur','Fahad','Jubyer','Shoeb','Sanim'] , 'LName': ['Musfique','Islam','Rafsun','Sikder','null'] , 'ID': [193002154,193002039,193002070,193002041,193002037] , 'NoOfGF': [0,10,2,22,69]}
lab = ['a','b','c','d','e']
tab4=pd.DataFrame(table4, index=lab)
tab4

      FName     LName         ID  NoOfGF
a  Mahfujur  Musfique  193002154       0
b     Fahad     Islam  193002039      10
c    Jubyer    Rafsun  193002070       2
d     Shoeb    Sikder  193002041      22
e     Sanim      null  193002037      69

In [14]:
table5 = {'Name': ['Musfique','Khan'],'ID':[10,20]}
tab5=pd.DataFrame(table5)
tab5

       Name  ID
0  Musfique  10
1      Khan  20

In [10]:
table6 = {'Name': ['xyz','xxc'],'ID':[10,11]}
tab6=pd.DataFrame(table6)
tab6

  Name  ID
0  xyz  10
1  xxc  11

In [11]:
print(pd.__version__)

1.4.4

In [12]:
tab4.iloc[1:4]

    FName   LName         ID  NoOfGF
b   Fahad   Islam  193002039      10
c  Jubyer  Rafsun  193002070       2
d   Shoeb  Sikder  193002041      22